static GOOGLE_IME_TABLE_BASE: &str = "la	ぁ
li	ぃ
lu	ぅ
le	ぇ
lo	ぉ
lya	ゃ
lyu	ゅ
lyo	ょ
0	0
1	1
2	2
3	3
4	4
5	5
6	6
7	7
8	8
9	9
?	？
!	！
\"	\"
#	#
$	$
%	%
&	&
'	'
(	(
)	)
*	*
+	+
,	、
-	ー
.	。
/	/
:	:
;	;
<	<
=	=
>	>
?	？
@	@
[	「
\\	\\
]	」
^	^
_	_
`	`
{	{
|	|
}	}
~	~
z<	‥
z~	〜
z>	…
z/	・
z(	（
z)	）
z[	『
z]	』
z{	【
z}	】
zh	←
zj	↓
zk	↑
zl	→
z;	゛
z:	゜

a	あ
i	い
u	う
e	え
o	お
";

static CORVUS_SKK_TABLE_BASE: &str = "la	ぁ	ァ	ｧ	0
li	ぃ	ィ	ｨ	0
lu	ぅ	ゥ	ｩ	0
le	ぇ	ェ	ｪ	0
lo	ぉ	ォ	ｫ	0
lya	ゃ	ャ	ｬ	0
lyu	ゅ	ュ	ｭ	0
lyo	ょ	ョ	ｮ	0
0	0	0	0	0
1	1	1	1	0
2	2	2	2	0
3	3	3	3	0
4	4	4	4	0
5	5	5	5	0
6	6	6	6	0
7	7	7	7	0
8	8	8	8	0
9	9	9	9	0
?	？	？	?	0
!	！	！	!	0
\"	\"	\"	\"	0
#	#	#	#	0
$	$	$	$	0
%	%	%	%	0
&	&	&	&	0
'	'	'	'	0
(	（	（	（	0
)	）	）	）	0
*	*	*	*	0
+	+	+	+	0
,	、	、	、	0
-	ー	ー	ー	0
.	。	。	。	0
/	/	/	/	0
:	:	:	:	0
;	;	;	;	0
<	<	<	<	0
=	=	=	=	0
>	>	>	>	0
 	 	 	 	0
@	@	@	@	0
[	「	「	「	0
\\	\\	\\	\\	0
]	」	」	」	0
^	^	^	^	0
_	_	_	_	0
`	`	`	`	0
{	{	{	{	0
|	|	|	|	0
}	}	}	}	0
~	~	~	~	0
z<	‥	‥	‥	0
z>	…	…	…	0
z~	〜	〜	〜	0
z/	・	・	・	0
z(	(	(	(	0
z)	)	)	)	0
z[	『	『	『	0
z]	』	』	』	0
z{	【	【	【	0
z}	】	】	】	0
zK	←	←	←	0
zT	↓	↓	↓	0
zN	↑	↑	↑	0
zS	→	→	→	0

a	あ	ア	ｱ	0
i	い	イ	ｲ	0
u	う	ウ	ｳ	0
e	え	エ	ｴ	0
o	お	オ	ｵ	0";
